backend_api/app/Controllers/Laporancontroller.php

    public function index()
    {
        $db   = \Config\Database::connect();
        $data = $db->table('laporan l')
            ->select('l.*, k.nama_kategori')
            ->join('kategori_aduan k', 'k.id = l.kategori_id', 'left')
            ->orderBy('l.id', 'ASC')
            ->get()->getResultArray();
---
SELECT `l`.*, `k`.`nama_kategori`
FROM `laporan` `l`
LEFT JOIN `kategori_aduan` `k` ON `k`.`id` = `l`.`kategori_id`
ORDER BY `l`.`created_at` DESC