backend_api/app/Controllers/StatsController.php

SELECT `l`.`id`, `l`.`nama_pelapor`, `l`.`judul_laporan`, `l`.`status`, `l`.`created_at`, `k`.`nama_kategori`
FROM `laporan` `l`
LEFT JOIN `kategori_aduan` `k` ON `k`.`id` = `l`.`kategori_id`
ORDER BY `l`.`created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows` FROM `laporan`
SELECT COUNT(*) AS `numrows` FROM `kategori_aduan`
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `status` = 'menunggu'
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `status` = 'ditolak'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $terbaru = $db->table('laporan l')
            ->select('l.id, l.nama_pelapor, l.judul_laporan, l.status, l.created_at, k.nama_kategori')
            ->join('kategori_aduan k', 'k.id = l.kategori_id', 'left')
            ->orderBy('l.created_at', 'DESC')
            ->limit(5)
            ->get()->getResultArray();

        return $this->respond([
            'status'  => 200,
            'message' => 'Statistik berhasil diambil.',
            'data'    => [
                'total_laporan'   => $db->table('laporan')->countAll(),
                'total_kategori'  => $db->table('kategori_aduan')->countAll(),
                'menunggu'        => $db->table('laporan')->where('status', 'menunggu')->countAllResults(),
                'diproses'        => $db->table('laporan')->where('status', 'diproses')->countAllResults(),
                'selesai'         => $db->table('laporan')->where('status', 'selesai')->countAllResults(),
                'ditolak'         => $db->table('laporan')->where('status', 'ditolak')->countAllResults(),