backend_api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');

        if (empty($authHeader) || !str_starts_with($authHeader, 'Bearer ')) {
            return response()
                ->setJSON([
                    'status'  => 401,
                    'error'   => 'Unauthorized',
                    'message' => 'Token tidak ditemukan. Harap login terlebih dahulu.',
                ])
                ->setStatusCode(401);
        }

        $token = trim(substr($authHeader, 7));
        $db    = \Config\Database::connect();
        $user  = $db->table('users')->where('token', $token)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `token` = '0b2141d00f082f2ca48c55285e4661cd7247270ddb0ce22c7818eb497dc69143'